tutorials/compressible/rhoPisoFoam/ras/IAPWS97_Pipe/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField uniform 533.15;

boundaryField
{
     INLET
    {
        type            fixedValue;
        value           uniform 533.15;
    }
    OUTLET
    {
        type            inletOutlet;
        inletValue      uniform 533.15;
        value           uniform 533.15;
    }

    WALL_1
    {
        type            zeroGradient;
    }
    WALL_2
    {
        type            zeroGradient;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
