tutorials/compressible/rhoPisoFoam/ras/IAPWS97_Pipe/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1120;

boundaryField
{
    WALL_1
    {
        type            compressible::epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 1120;
    }
    WALL_2
    {
        type            compressible::epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 1120;
    }
    INLET
    {
        type            fixedValue;
        value           uniform 1120;
    }
    OUTLET
    {
        type            inletOutlet;
        inletValue      uniform 1120;
        value           uniform 1120;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
