tutorials/compressible/rhoPisoFoam/ras/IAPWS97_Pipe/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 80e5;

boundaryField
{
     INLET
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1.4;
        p0              uniform 8.01e+06;
        value           uniform 8.01e+06;
    }
    OUTLET
    {
        type            fixedValue;
        value           uniform 8e+06;
    }

    WALL_1
    {
        type            zeroGradient;
    }
    WALL_2
    {
        type            zeroGradient;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
